{
  "meanings": [
    {
      "id": 0,
      "POS": "verb, noun",
      "definition": "carefree, freedom from constraint",
      "synonyms": "unconstrained, uninhibitedness, unrestraint",
      "antonyms": "",
      "example": "abandon oneself to emotion"
    },
    {
      "id": 1,
      "POS": "verb",
      "definition": "to withdraw from often in the face of danger or encroachment",
      "synonyms": "",
      "antonyms": "salvage",
      "example": ""
    },
    {
      "id": 2,
      "POS": "verb",
      "definition": "to lower in rank, office, prestige, or esteem",
      "synonyms": "debauch, degrade, profane, vitiate, discredit, foul, smirch, take down",
      "antonyms": "elevate, ennoble, uplift, aggrandize, canonize, deify, exalt",
      "example": "He was unwilling to abase himself by pleading guilty to a crime that he did not commit."
    },
    {
      "id": 3,
      "POS": "verb.t",
      "definition": "to destory the self-confidence, embarrass",
      "synonyms": "",
      "antonyms": "",
      "example": "Some regugees stare down the camera; a young girl smiles, while her father looks down, abashed."
    },
    {
      "id": 4,
      "POS": "verb",
      "definition": "to reduce in degree, intensity or amount, value",
      "synonyms": "",
      "antonyms": "",
      "example": "abate his rage/pain, abate a tax"
    },
    {
      "id": 5,
      "POS": "verb",
      "definition": "to renounce a throne",
      "synonyms": "",
      "antonyms": "",
      "example": "In 1918, Kaiser Wilhelm abdicated as German emperor."
    },
    {
      "id": 6,
      "POS": "adj",
      "definition": "deviating from the usual or natural type",
      "synonyms": "",
      "antonyms": "",
      "example": "This aberrant, if not criminal, behavior must not be tolerated."
    },
    {
      "id": 7,
      "POS": "verb",
      "definition": "to help someone do something, usually something wrong",
      "synonyms": "",
      "antonyms": "",
      "example": "If you were the lookout while your older sister swiped cookies from the cookie jar, you abetted her mischief."
    },
    {
      "id": 8,
      "POS": "noun",
      "definition": "An abeyance is a temporary halt to something, with the emphasis on 'temporary'.",
      "synonyms": "",
      "antonyms": "",
      "example": "hold the plan in abeyance"
    },
    {
      "id": 9,
      "POS": "adj",
      "definition": "Lasting for a long time. Abiding is usually used with feelings and memories",
      "synonyms": "",
      "antonyms": "",
      "example": "Trump, it said, 'aims to reaffirm the deep and abiding U.S. commitment to Egypt’s security, stability and prosperity.'"
    },
    {
      "id": 10,
      "POS": "adj",
      "definition": "Miserable. If it reeks of humiliation or looks like the lowest of lows, then you can safely describe it as abject. Abject means absolutely miserable, the most unfortunate, with utter humiliation. You might have heard the phrase abject poverty, which is the absolute worst, most hopeless level of poverty you've ever seen.",
      "synonyms": "",
      "antonyms": "",
      "example": "Almost 85% of Syrians live in poverty, with more than two-thirds of the population in either extreme or abject poverty."
    },
    {
      "id": 11,
      "POS": "adj",
      "definition": "completely without pride or dignity; self-abasing",
      "synonyms": "",
      "antonyms": "",
      "example": "an abject apology"
    },
    {
      "id": 12,
      "POS": "verb",
      "definition": "A firm and final rejecting or abandoning. Abjure means to swear off, and it applies to something you once believed. You can abjure a religious faith, you can abjure your love of another person, and you can abjure the practice of using excessive force in interrogation.",
      "synonyms": "",
      "antonyms": "",
      "example": "His new plan would introduce “gender perspectives” into the national curriculum, encouraging teachers “constantly to refer to both sexes” and to abjure sexual stereotypes."
    },
    {
      "id": 13,
      "POS": "verb",
      "definition": "abhor, to hate or loathe intensely",
      "synonyms": "",
      "antonyms": "",
      "example": "I know everybody uses scent nowadays, but my mother, whose sense of smell is even more acute than her hearing, abominates scent."
    },
    {
      "id": 14,
      "POS": "verb",
      "definition": "Abrogate means to abolish or avoid. When someone cuts in front of you in line, they are abrogating your right to be the next one served. When you cut in line, you are abrogating your responsibility to those who were in line before you.",
      "synonyms": "",
      "antonyms": "",
      "example": "abrogate the law; abrogate their responsibilities"
    }, 
    {
      "id": 15,
      "POS": "verb",
      "definition": "Abscond is to escape, often taking something along. As a kid, you may have absconded from your lemonade stand — with the coffee can of cash in hand, and your bewildered sister still filling cups for your customers.",
      "synonyms": "",
      "antonyms": "",
      "example": "abscond form the prison"
    },
    {
      "id": 16,
      "POS": "verb",
      "definition": "To be absolved is to be let off the hook, to be set free from a certain obligation or to be forgiven for a wrongdoing.",
      "synonyms": "",
      "antonyms": "",
      "example": "absolve somebody from blame"
    },
    {
      "id": 17,
      "POS": "verb",
      "definition": "If you abstain from something, you restrain yourself from consuming it. People usually abstain from things that are considered vices — like drinking alcohol or eating chocolate.",
      "synonyms": "",
      "antonyms": "",
      "example": "abstain from smoking"
    },
    {
      "id": 18,
      "POS": "adj",
      "definition": "Reserve abstemious for someone who exercises restraint, especially with regard to alcohol. A rock musician may sing about enjoying wine and women, but in his private life he may be abstemious.",
      "synonyms": "",
      "antonyms": "",
      "example": "an abstemious diet/meals"
    },
    {
      "id": 19,
      "POS": "adj",
      "definition": "difficult to comprehend",
      "synonyms": "",
      "antonyms": "",
      "example": "Let me just say that I understand Trump’s abstruse elocution."
    },
    {
      "id": 20,
      "POS": "adj",
      "definition": "Something absurd is really silly, absolutely ridiculous, or total nonsense. Thinking you can wear flip flops and a bikini to the North Pole is an absurd idea, for example.",
      "synonyms": "",
      "antonyms": "",
      "example": "an absurd argument"
    },
    {
      "id": 21,
      "POS": "verb",
      "definition": "If you accede, it means you agree with someone or give in to his or her wish. The word is often used in a political context — the Queen acceded to the Prince's demands for more territory, a larger army, and funnier jesters.",
      "synonyms": "",
      "antonyms": "",
      "example": "accede to public demand"
    },
    {
      "id": 22,
      "POS": "noun/verb",
      "definition": "an expression of approval, to praise or honor",
      "synonyms": "",
      "antonyms": "",
      "example": "The director won virtually every accolade that the film world offered"
    },
    {
      "id": 23,
      "POS": "verb",
      "definition": "to grow or increase gradually, as by addition",
      "synonyms": "",
      "antonyms": "",
      "example": "accrete the public interest"
    },
    {
      "id": 24,
      "POS": "adj",
      "definition": "If you say something acerbic, or harshly bitter, to someone, it can leave a bitter taste in your own mouth that lingers, and the acerbic, or acidic, words can eat away at the person on the receiving end too.",
      "synonyms": "",
      "antonyms": "",
      "example": "acerbic commentary"
    },
    {
      "id": 25,
      "POS": "adj",
      "definition": "When something is at the very peak of perfection, reach for this noun from Greek: acme.",
      "synonyms": "",
      "antonyms": "",
      "example": "A brilliant violinist might reach the acme of her career, but eventually she might become unstrung."
    },
    {
      "id": 26,
      "POS": "verb",
      "definition": "accept something reluctantly but without protest",
      "synonyms": "",
      "antonyms": "",
      "example": "If your kid sister is refusing to hand over the television remote, you hope she acquiesces before your favorite show comes on"
    },
    {
      "id": 27,
      "POS": "adj",
      "definition": "having an irritatingly strong and unpleasant taste or smell, or marked by the use of wit that is intended to cause hurt feelings",
      "synonyms": "",
      "antonyms": "",
      "example": "acrid fumes"
    },
    {
      "id": 28,
      "POS": "adj",
      "definition": "unshakable or insistent especially in maintaining a position or opinion",
      "synonyms": "",
      "antonyms": "",
      "example": "If you stubbornly refuse to change your mind about something, you are adamant about it."
    },
    {
      "id": 29,
      "POS": "verb",
      "definition": "literally it means 'stick to', and figuratively it means 'follow, obey'",
      "synonyms": "",
      "antonyms": "",
      "example": "Will this wallpaper adhere to the wall? / adhere to the rules"
    },
    {
      "id": 30,
      "POS": "verb.i",
      "definition": "To adjourn is to close a session of something, like at court. People also adjourn when they go to bed.",
      "synonyms": "",
      "antonyms": "",
      "example": "The meeting adjourned for a week"
    },
    {
      "id": 31,
      "POS": "noun",
      "definition": "Adjunct means something added on, but not part of the whole. An adjunct professor is someone who is hired by a college to teach but isn't a full member of the faculty.",
      "synonyms": "",
      "antonyms": "",
      "example": "After retiring, he spent 18 years as an adjunct professor at Johns Hopkins University in Baltimore, running the Center for Materials Research."
    },
    {
      "id": 32,
      "POS": "verb",
      "definition": "to give advice to",
      "synonyms": "",
      "antonyms": "",
      "example": "admonish the patient to eat mpre healthy foods"
    },
    {
      "id": 33,
      "POS": "verb",
      "definition": "To admonish is to scold. If you want to show someone you're not happy with his behavior, admonish him.",
      "synonyms": "",
      "antonyms": "",
      "example": "admonish her for littering"
    },
    {
      "id": 34,
      "POS": "verb",
      "definition": "To adulate is to flatter someone. A lot. Like, drop-on-your-knees-and-clasp-your-hands-and-say-'you-are-the-greatest-ever-to-walk-the-earth' a lot.",
      "synonyms": "",
      "antonyms": "",
      "example": "adulate his/her boss"
    },
    {
      "id": 35,
      "POS": "to corrupt, debase, or make impure by the addition of a foreign or inferior substance of element",
      "definition": "",
      "synonyms": "",
      "antonyms": "",
      "example": "adulterate its products with cheap additives"
    },
    {
      "id": 36,
      "POS": "verb.t",
      "definition": "report or represent in outline, or to give a slight indication of beforehand",
      "synonyms": "",
      "antonyms": "",
      "example": "The strife in Bloody Kansas adumbrated the civil war that would follow"
    },
    {
      "id": 37,
      "POS": "adj",
      "definition": "coming from another source and not inherent or innate",
      "synonyms": "",
      "antonyms": "",
      "example": "adventitious viruses"
    },
    {
      "id": 38,
      "POS": "noun",
      "definition": "opponent, enemy",
      "synonyms": "",
      "antonyms": "",
      "example": "political adversary"
    }, 
    {
      "id": 39,
      "POS": "adj",
      "definition": "Affable means friendly, pleasant, and easy to talk to. An affable host offers you something to drink and makes you feel at home.",
      "synonyms": "",
      "antonyms": "",
      "example": "anaffable manner"
    },
    {
      "id": 40,
      "POS": "adj",
      "definition": "You know you're driving through an affluent neighborhood when you see large houses, perfect landscaping, and expensive cars. Use affluent to describe wealthy people or areas.",
      "synonyms": "",
      "antonyms": "",
      "example": "affluent society"
    },
    {
      "id": 41,
      "POS": "verb.t",
      "definition": "If you are a window washer, but you refer to yourself as a 'vista enhancement specialist,' then you are aggrandizing your job title — that is, making it sound greater than it is.'' The verb aggrandize not only means 'to make appear greater'; it can also be used to mean simply 'to make greater.'",
      "synonyms": "",
      "antonyms": "",
      "example": "exploit the situation to aggrandize himself"
    },
    {
      "id": 42,
      "POS": "verb",
      "definition": "to attempt to arouse public feeling",
      "synonyms": "",
      "antonyms": "",
      "example": "agitate for better conditions"
    },
    {
      "id": 43,
      "POS": "verb.t",
      "definition": "disturb, Someone who is agitated is visibly upset. If you have ever walked into a room and instantly been asked, 'What's wrong?' you probably looked agitated.",
      "synonyms": "",
      "antonyms": "",
      "example": "When pressed on the matter, Westbrook became more agitated, repeatedly saying 'Next question.'"
    },
    {
      "id": 44,
      "POS": "adj",
      "definition": "with great excitement and interest",
      "synonyms": "",
      "antonyms": "",
      "example": "Children were agog over new toys"
    },
    {
      "id": 45,
      "POS": "undergo great mental anguish through worrying about something",
      "definition": "",
      "synonyms": "",
      "antonyms": "",
      "example": "The mother of a teenage boy might agonize over his safety when he first learns to drive."
    },
    {
      "id": 46,
      "POS": "noun",
      "definition": "Someone with alacrity shows cheerful willingness and eager behavior, like a kid whose mother has told him he can buy anything in a candy store.",
      "synonyms": "",
      "antonyms": "",
      "example": ""
    },
    {
      "id": 47,
      "POS": "noun",
      "definition": "Your alibi is evidence that proves your innocence. Or an excuse intended to avert blame or punnishment",
      "synonyms": "",
      "antonyms": "",
      "example": "He always has a very creative alibi for undone homework"
    },
    {
      "id": 48,
      "POS": "noun",
      "definition": "devotion or olyalty to a person, group or cause",
      "synonyms": "",
      "antonyms": "",
      "example": "The swore their allegiance to the USAs"
    },
    {
      "id": 49,
      "POS": "verb.i",
      "definition": "When you allude to something, you don't identify it or mention it specifically",
      "synonyms": "",
      "antonyms": "",
      "example": "If you allude to the fact that a cop is sitting right behind you, your friends might stop talking about their plans to rob a bank."
    },
    {
      "id": 50,
      "POS": "adj",
      "definition": "Someone who's aloof isn't warm and friendly, instead being distant and reserved.",
      "synonyms": "",
      "antonyms": "",
      "example": "Far from man’s best friend, they’re notoriously aloof and cunning."
    },
    {
      "id": 51,
      "POS": "verb",
      "definition": "To amalgamate is to combine different things to create something new.",
      "synonyms": "",
      "antonyms": "",
      "example": "amalgamate with an American company"
    },
    {
      "id": 52,
      "POS": "vert.i/noun",
      "definition": "to walk slowly and lesuirely; stroll",
      "synonyms": "",
      "antonyms": "",
      "example": ""
    },
    {
      "id": 53,
      "POS": "adj",
      "definition": "something extremely pleasing to taste or smell",
      "synonyms": "",
      "antonyms": "",
      "example": "The ambrosial aroma of the roast stimulated our appetities"
    },
    {
      "id": 54,
      "POS": "vert.t",
      "definition": "To ameliorate is to step in and make a bad situation better.",
      "synonyms": "",
      "antonyms": "",
      "example": "You could try introducing a second lollipop to ameliorate a battle between two toddlers over a single lollipop."
    },
    {
      "id": 55,
      "POS": "adj",
      "definition": "If a person or thing is amenable to something, they are ready, willing, or responsive.",
      "synonyms": "",
      "antonyms": "",
      "example": "If your friends want to try sky diving and you're amenable to the idea, sounds like you're going to be jumping out of a plane."
    },
    {
      "id": 56,
      "POS": "adj",
      "definition": "having not definite from: shapeless",
      "synonyms": "",
      "antonyms": "",
      "example": "an amorphous cloud mass"
    },
    {
      "id": 57,
      "POS": "adj",
      "definition": "not likely to cause or being capable of causing injury or hurt",
      "synonyms": "",
      "antonyms": "",
      "example": "The otherwise anodyne comments sound quite inflammatory when taken out of context"
    },
    {
      "id": 58,
      "POS": "noun",
      "definition": "somehing or someone that is hated",
      "synonyms": "",
      "antonyms": "",
      "example": "Violence was anathema to them"
    },
    {
      "id": 59,
      "POS": "adj",
      "definition": "Sometimes you can tell just from looking at someone's pale face and lips that they're anemic. If you're anemic, your body has a shortage of healthy red blood cells.",
      "synonyms": "",
      "antonyms": "",
      "example": "an anemic economic recovery"
    },
    {
      "id": 60,
      "POS": "adj/noun",
      "definition": "The next time you go to the dentist, make sure you know the word anesthetic. This drug causes a temporary loss of feeling, making it your best friend if the drill has to be used.",
      "synonyms": "",
      "antonyms": "",
      "example": "be anesthetic to their feelings"
    },
    {
      "id": 61,
      "POS": "noun",
      "definition": "a usually prejudiced and often spiteful or malevolent ill will, enmity",
      "synonyms": "",
      "antonyms": "",
      "example": "She felt no animus toward those who had wronged her"
    },
    {
      "id": 62,
      "POS": "verb.t",
      "definition": "to declare or make legally invalid or void",
      "synonyms": "",
      "antonyms": "",
      "example": "annul the contract"
    },
    {
      "id": 63,
      "POS": "verb.t",
      "definition": "to act in opposition to; counteract",
      "synonyms": "",
      "antonyms": "",
      "example": "antagonize a bill"
    },
    {
      "id": 64,
      "POS": "verb.t",
      "definition": "to incur or provoke the hostility of",
      "synonyms": "",
      "antonyms": "",
      "example": "His remark antagonized his friends"
    },
    {
      "id": 65,
      "POS": "adj",
      "definition": "Antediluvian means 'before the flood' — that is, the Biblical flood with Noah's ark. Generally, though, the word is used — often humorously — to describe something really, really old.",
      "synonyms": "",
      "antonyms": "",
      "example": "He has antediluvian notions about the role of women in the workplace"
    },
    {
      "id": 66,
      "POS": "adj",
      "definition": "coming before in time or development",
      "synonyms": "",
      "antonyms": "",
      "example": "finish the work anterior to the schedule; tests anterior to the college entrance examination"
    },
    {
      "id": 67,
      "POS": "An antic is a prank to the extreme. It’s outrageous, but it’s usually meant to be funny. When the senior class steals the principal’s car and manages to get it inside the gym, the antic may be condemned by the school, but everyone else probably thinks it’s hilarious.",
      "definition": "",
      "synonyms": "",
      "antonyms": "",
      "example": "The clown came on with many antic gestures"
    },
    {
      "id": 68,
      "POS": "noun",
      "definition": "Use the noun apathy when someone isn't interested in the important things that are happening.",
      "synonyms": "",
      "antonyms": "",
      "example": "She heard the story with apathy"
    },
    {
      "id": 69,
      "POS": "adj",
      "definition": "of a revelatory or prophetic nature",
      "synonyms": "",
      "antonyms": "",
      "example": "No one listened to her apocalyptic predictions"
    },
    {
      "id": 70,
      "POS": "adj",
      "definition": "being a major turing point",
      "synonyms": "",
      "antonyms": "",
      "example": "The apocalyptic Battle Of Stalingrad led to the ultimate defeat of Nazi Germany"
    },
    {
      "id": 71,
      "POS": "adj",
      "definition": "of doubtful anthenticity: spurious",
      "synonyms": "",
      "antonyms": "",
      "example": "an apocryphal story about president's childhood"
    },
    {
      "id": 72,
      "POS": "adj",
      "definition": "Someone who is apoplectic is not just mad — they're so filled with rage, they can barely communicate.",
      "synonyms": "",
      "antonyms": "",
      "example": "If your mother is apoplectic, you'd better hope it isn't over something you did."
    },
    {
      "id": 73,
      "POS": "noun",
      "definition": "abandonment of a previous loyalty: defection",
      "synonyms": "",
      "antonyms": "",
      "example": "He was looked down upon for apostasy"
    },
    {
      "id": 74,
      "POS": "vert.t",
      "definition": "Appalled is an adjective that describes feeling shocked and disappointed.",
      "synonyms": "",
      "antonyms": "",
      "example": "He felt appalled by the whole idea of marriage, so we broke up"
    },
    {
      "id": 75,
      "POS": "adj",
      "definition": "fitting or relevant",
      "synonyms": "",
      "antonyms": "",
      "example": "enrich his essay with some very apposite quotations from famous people"
    },
    {
      "id": 76,
      "POS": "noun",
      "definition": "Apprehension is fear or anxiety about something – you might feel apprehension about an upcoming test.",
      "synonyms": "",
      "antonyms": "",
      "example": "She had a stong apprehension about her sister's health"
    },
    {
      "id": 77,
      "POS": "noun",
      "definition": "the knowledge gained from the process of coming to know or understand something",
      "synonyms": "",
      "antonyms": "",
      "example": "sudden apprehension of something strange"
    },
    {
      "id": 78,
      "POS": "adj/prep",
      "definition": "having to do with",
      "synonyms": "",
      "antonyms": "",
      "example": "The actor announced to reporters that he would only answer to apropos questions about the movie"
    },
    {
      "id": 79,
      "POS": "If you use the adjective archaic you are referring to something outmoded, belonging to an earlier period.",
      "definition": "",
      "synonyms": "",
      "antonyms": "",
      "example": "archaic laws"
    },
    {
      "id": 80,
      "POS": "adj",
      "definition": "hard to accomplish or achieve: difficult",
      "synonyms": "",
      "antonyms": "",
      "example": "a long and arduous undertaking"
    },
    {
      "id": 81,
      "POS": "adj",
      "definition": "Anthropogenic is an adjective that describes changes in nature made by people.",
      "synonyms": "",
      "antonyms": "",
      "example": "Anthropogenic degradation of the environment"
    },
    {
      "id": 82,
      "POS": "adj",
      "definition": "practicing strict self-denial as a measure of personal and especially spiritual discipline",
      "synonyms": "",
      "antonyms": "",
      "example": "Want to live an ascetic lifestyle? Then you better ditch the flat panel TV and fuzzy slippers."
    },
    {
      "id": 83,
      "POS": "adj/adv",
      "definition": "preventing infection",
      "synonyms": "",
      "antonyms": "",
      "example": "Surgery must be in aseptic environments"
    }
  ]
}
